Autodesk.Revit.DB.FittingAndAccessoryCalculationType
The MEP fitting and accessory pressure drop calculation type.
Enum of fitting and accessory pressure drop calculation type.

Autodesk.Revit.DB.FittingAndAccessoryCalculationType.ValidateCurrentSettings
To validate the current settings of the fitting and accessory.

Autodesk.Revit.DB.FittingAndAccessoryCalculationType.CalculateDefaultSettings
To calculate the default settings of the fitting and accessory.

Autodesk.Revit.DB.FittingAndAccessoryCalculationType.CalculatePressureDrop
To calculate the pressure drop of the fitting and accessory.

Autodesk.Revit.DB.FittingAndAccessoryCalculationType.Undefined
Undefined fitting and accessory pressure drop calculation type.